tap "homebrew/bundle"
tap "homebrew/cask", "https://github.com/Homebrew/homebrew-cask.git"
tap "homebrew/cask-fonts", "https://github.com/Homebrew/homebrew-cask-fonts.git"
tap "homebrew/core", "https://github.com/Homebrew/homebrew-core.git"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Secure and free password manager for all of your devices
brew "bitwarden-cli"
# Yet another cross-platform graphical process/system monitor
brew "bottom"
# Manage your dotfiles across multiple diverse machines, securely
brew "chezmoi"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Command-line fuzzy finder written in Go
brew "fzf"
# Distributed revision control system
brew "git"
# Syntax-highlighting pager for git and diff output
brew "git-delta"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Fast linters runner for Go
brew "golangci-lint"
# GO Simple Tunnel - a simple tunnel written in golang
brew "gost"
# Like cURL, but for gRPC
brew "grpcurl"
# System monitoring dashboard for terminal
brew "gtop"
# Clone of ls with colorful output, file type icons, and more
brew "lsd"
# Utility for directing compilation
brew "make"
# Mac App Store command-line interface
brew "mas"
# Development kit for the Java programming language
brew "openjdk"
# Java-based project management
brew "maven"
# Manage multiple Node.js versions
brew "nvm"
# Protocol buffers (Google's data interchange format)
brew "protobuf"
# Python version management
brew "pyenv"
# Command-line interface for SQLite
brew "sqlite"
# Interpreted, interactive, object-oriented programming language
brew "python@3.9"
# File browser
brew "ranger"
# Reattach process (e.g., tmux) to background
brew "reattach-to-user-namespace"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Utility that provides fast incremental file transfer
brew "rsync"
# Generate ASCII art with terminal, shell, and OS info
brew "screenfetch"
# Simplified and community-driven man pages
brew "tldr"
# Terminal multiplexer
brew "tmux"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Vi 'workalike' with many additional features
brew "vim"
# Internet file retriever
brew "wget"
# Shell extension to navigate your filesystem faster
brew "zoxide"
# QuickLook plug-in that renders source code with syntax highlighting
cask "qlcolorcode"
# QuickLook generator for Markdown files
cask "qlmarkdown"
cask "qlstephen"
cask "quicklook-json"
# Rime input method engine
cask "squirrel"
mas "Hidden Bar", id: 1452453066
mas "iMovie 剪辑", id: 408981434
mas "Keynote 讲演", id: 409183694
mas "Numbers 表格", id: 409203825
mas "Pages 文稿", id: 409201541
mas "QQ", id: 451108668
mas "Spark", id: 1176895641
mas "WPS Office", id: 1443749478
mas "库乐队", id: 682658836
mas "微信", id: 836500024
