tap "homebrew/bundle"
tap "homebrew/cask", "https://github.com/Homebrew/homebrew-cask.git"
tap "homebrew/cask-fonts", "https://github.com/Homebrew/homebrew-cask-fonts.git"
tap "homebrew/core", "https://github.com/Homebrew/homebrew-core.git"
tap "vldmrkl/formulae"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Secure and free password manager for all of your devices
brew "bitwarden-cli"
# Yet another cross-platform graphical process/system monitor
brew "bottom"
# Manage your dotfiles across multiple diverse machines, securely
brew "chezmoi"
# Top-like interface for container metrics
brew "ctop"
# Modern replacement for 'ls'
brew "exa"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Command-line fuzzy finder written in Go
brew "fzf"
# Distributed revision control system
brew "git"
# Syntax-highlighting pager for git and diff output
brew "git-delta"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Fast linters runner for Go
brew "golangci-lint"
# GO Simple Tunnel - a simple tunnel written in golang
brew "gost"
# Like cURL, but for gRPC
brew "grpcurl"
# System monitoring dashboard for terminal
brew "gtop"
# Simple terminal UI for git commands
brew "lazygit"
# Clone of ls with colorful output, file type icons, and more
brew "lsd"
# Utility for directing compilation
brew "make"
# Mac App Store command-line interface
brew "mas"
# Development kit for the Java programming language
brew "openjdk"
# Java-based project management
brew "maven"
# Fast, highly customisable system info script
brew "neofetch"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Manage multiple Node.js versions
brew "nvm"
# Protocol buffers (Google's data interchange format)
brew "protobuf"
# Python version management
brew "pyenv"
# Command-line interface for SQLite
brew "sqlite"
# Interpreted, interactive, object-oriented programming language
brew "python@3.9"
# File browser
brew "ranger"
# Reattach process (e.g., tmux) to background
brew "reattach-to-user-namespace"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Utility that provides fast incremental file transfer
brew "rsync"
# Simplified and community-driven man pages
brew "tldr"
# Terminal multiplexer
brew "tmux"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Vi 'workalike' with many additional features
brew "vim"
# Internet file retriever
brew "wget"
# Shell extension to navigate your filesystem faster
brew "zoxide"
# macOS CLI for AirDrop
brew "vldmrkl/formulae/airdrop-cli"
# Application launcher and productivity software
cask "alfred"
# Redis desktop manager
cask "another-redis-desktop-manager"
# Desktop password and login vault
cask "bitwarden"
# Translation application for text, pictures, and manual input
cask "bob"
# Server and cloud storage browser
cask "cyberduck"
# Teamwork app by Alibaba Group
cask "dingtalk"
# Downloads videos from different websites
cask "downie"
# Terminal/ssh/serial port/sftp client
cask "electerm"
# Download accelerator and organizer
cask "free-download-manager"
# Utility to hide menu bar items
cask "hiddenbar"
# Free and open-source media player
cask "iina"
# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2"
# JetBrains tools manager
cask "jetbrains-toolbox"
# Open-source keystroke visualizer
cask "keycastr"
# Snippet management app
cask "lepton"
# Utility to open, create and modify archive files
cask "maczip"
# Provides updates to various Microsoft products
cask "microsoft-auto-update"
# Web browser
cask "microsoft-edge"
# Smooths scrolling and set mouse scroll directions independently
cask "mos"
# Re-mounts write-protected NTFS volumes
cask "mounty"
# Music streaming platform
cask "neteasemusic"
# Collaboration platform for API development
cask "postman"
# QuickLook plug-in that renders source code with syntax highlighting
cask "qlcolorcode"
# QuickLook generator for Markdown files
cask "qlmarkdown"
cask "qlstephen"
# Instant messaging tool
cask "qq"
cask "quicklook-json"
# Move and resize windows using keyboard shortcuts or snap areas
cask "rectangle"
# Snip or pin screenshots
cask "snipaste"
# Rime input method engine
cask "squirrel"
# System monitor for the menu bar
cask "stats"
# App to switch hosts
cask "switchhosts"
# Configurable document editor that supports Markdown
cask "typora"
# Free messaging and calling application
cask "wechat"
# Weixin DevTools for Official Account and Mini Program development
cask "wechatwebdevtools"
mas "iMovie 剪辑", id: 408981434
mas "Keynote 讲演", id: 409183694
mas "Numbers 表格", id: 409203825
mas "Pages 文稿", id: 409201541
mas "Spark", id: 1176895641
mas "WPS Office", id: 1443749478
mas "Xcode", id: 497799835
mas "库乐队", id: 682658836
