tap "homebrew/bundle"
tap "homebrew/cask", "https://github.com/Homebrew/homebrew-cask.git"
tap "homebrew/cask-fonts", "https://github.com/Homebrew/homebrew-cask-fonts.git"
tap "homebrew/core"
tap "hpedrorodrigues/tools"
tap "vldmrkl/formulae"
# Simple, modern, secure file encryption
brew "age"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Cryptography and SSL/TLS Toolkit
brew "openssl@1.1"
# Secure and free password manager for all of your devices
brew "bitwarden-cli"
# General-purpose data compression with high compression ratio
brew "xz"
# Yet another cross-platform graphical process/system monitor
brew "bottom"
# Core application library for C
brew "glib"
# Manage your dotfiles across multiple diverse machines, securely
brew "chezmoi"
# Top-like interface for container metrics
brew "ctop"
# Secure runtime for JavaScript and TypeScript
brew "deno"
# Load/unload environment variables based on $PWD
brew "direnv"
# More intuitive version of du in rust
brew "dust"
# Modern replacement for 'ls'
brew "exa"
# Simple, fast and user-friendly alternative to find
brew "fd"
# macOS CLI for managing custom icons for files and folders
brew "fileicon"
# Collection of reusable C++ library artifacts developed at Facebook
brew "folly"
# Terminal JSON viewer
brew "fx"
# Command-line fuzzy finder written in Go
brew "fzf"
# GitHub command-line tool
brew "gh"
# Distributed revision control system
brew "git"
# Syntax-highlighting pager for git and diff output
brew "git-delta"
# Library for command-line editing
brew "readline"
# GNU Ubiquitous Intelligent Language for Extensions
brew "guile"
# Validating, recursive, caching DNS resolver
brew "unbound"
# GNU Transport Layer Security (TLS) Library
brew "gnutls"
# GNU Pretty Good Privacy (PGP) package
brew "gnupg"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Go implementation of configuration language for defining JSON data
brew "go-jsonnet"
# Go version management
brew "goenv", args: ["HEAD"]
# Fast linters runner for Go
brew "golangci-lint"
# GO Simple Tunnel - a simple tunnel written in golang
brew "gost"
# Command-line tool for generating regular expressions
brew "grex"
# Like cURL, but for gRPC
brew "grpcurl"
# OpenType text shaping engine
brew "harfbuzz"
# Manage your Java environment
brew "jenv"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Lazier way to manage everything docker
brew "lazydocker"
# Simple terminal UI for git commands
brew "lazygit"
# Powerful, lightweight programming language
brew "lua"
# Bare libuv bindings for lua
brew "luv"
# Utility for directing compilation
brew "make"
# Mac App Store command-line interface
brew "mas"
# Development kit for the Java programming language
brew "openjdk"
# Java-based project management
brew "maven"
# Fast, highly customisable system info script
brew "neofetch"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# HTTP/2 C Library
brew "nghttp2"
# Manage multiple Node.js versions
brew "nvm"
# Development kit for the Java programming language
brew "openjdk@11"
# Framework for layout and rendering of i18n text
brew "pango"
# Pinentry for GPG on Mac
brew "pinentry-mac"
# 📦🚀 Fast, disk space efficient package manager
brew "pnpm"
# Python package management tool
brew "poetry"
# Protocol buffers (Google's data interchange format)
brew "protobuf"
# Python version management
brew "pyenv"
# Interpreted, interactive, object-oriented programming language
brew "python@3.9"
# Small and embeddable JavaScript engine
brew "quickjs"
# File browser
brew "ranger"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Utility that provides fast incremental file transfer
brew "rsync"
# Powerful, clean, object-oriented scripting language
brew "ruby"
# 7-Zip is a file archiver with a high compression ratio
brew "sevenzip"
# Simplified and community-driven man pages
brew "tldr"
# Terminal multiplexer
brew "tmux"
# Program that allows you to count code, quickly
brew "tokei"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# File synchronization tool for OSX
brew "unison"
# Vi 'workalike' with many additional features
brew "vim"
# Internet file retriever
brew "wget"
# Process YAML documents from the CLI
brew "yq"
# Shell extension to navigate your filesystem faster
brew "zoxide"
# macOS CLI for AirDrop
brew "vldmrkl/formulae/airdrop-cli"
# Application launcher and productivity software
cask "alfred"
# Enable Windows-like alt-tab
cask "alt-tab"
# Redis desktop manager
cask "another-redis-desktop-manager"
# Desktop password and login vault
cask "bitwarden"
# Translation application for text, pictures, and manual input
cask "bob"
# Server and cloud storage browser
cask "cyberduck"
# Teamwork app by Alibaba Group
cask "dingtalk"
# App to build and share containerized applications and microservices
cask "docker"
# Downloads videos from different websites
cask "downie"
# Client for the Dropbox cloud storage service
cask "dropbox"
# Terminal/ssh/sftp client
cask "electerm"
# Download accelerator and organizer
cask "free-download-manager"
# Tools to protect your files
cask "gpg-suite-no-mail"
# Desktop automation application
cask "hammerspoon"
# Free and open-source media player
cask "iina"
# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2"
# Menu bar calendar
cask "itsycal"
# JetBrains tools manager
cask "jetbrains-toolbox"
# Open-source screen recorder built with web technology
cask "kap"
# Keyboard customizer
cask "karabiner-elements"
# Open-source keystroke visualizer
cask "keycastr"
# Snippet management app
cask "lepton"
# Utility to open, create and modify archive files
cask "maczip"
# Simple and elegant markdown editor
cask "mark-text"
# Provides updates to various Microsoft products
cask "microsoft-auto-update"
# Web browser
cask "microsoft-edge"
# Smooths scrolling and set mouse scroll directions independently
cask "mos"
# Re-mounts write-protected NTFS volumes
cask "mounty"
# Neovim Client
cask "neovide"
# Music streaming platform
cask "neteasemusic"
# Collaboration platform for API development
cask "postman"
# Instant messaging tool
cask "qq"
# Move and resize windows using keyboard shortcuts or snap areas
cask "rectangle"
# Open source virtual/remote desktop application
cask "rustdesk"
# Displays all open files and sockets in use by all running processes
cask "sloth"
# Snip or pin screenshots
cask "snipaste"
# Rime input method engine
cask "squirrel"
# System monitor for the menu bar
cask "stats"
# App to switch hosts
cask "switchhosts"
# Free messaging and calling application
cask "wechat"
# Wechat DevTools for Official Account and Mini Program development
cask "wechatwebdevtools"
mas "Bob", id: 1630034110
mas "Spark", id: 1176895641
mas "WPS Office", id: 1443749478
mas "Xcode", id: 497799835